{"data":{"markdownRemark":{"html":"<h3>Update 2.3.2017:</h3>\n<p>I created a setup and walkthrough video of the features of CodeKit 3.</p>\n<h2><iframe class=\"video\" width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/w7mU-yGfgq0\" frameborder=\"0\" allowfullscreen></iframe></h2>\n<p>I've lived in Nashville and worked in the recording industry for the better part of a decade. One thing for sure, there is no shortage of recording engineers &#x26; musicians that have opinions on what equipment/tools are \"the best\". I suppose the same can be said in a lot of industries but at the end of the day, equipment, computers, software, etc are just tools. They are no different than a hammer.  </p>\n<p>There are there are lot of front-end toolchains out there such as Webpack, Babel, Gulp, Grunt, etc. that have many of the same capabilities (and some different). While powerful and flexible, they can sometimes take a while to configure at the start of a project. In some cases, sometimes you just need to get a local webserver running and a mechanism to compile Sass to browser readable code and get rolling on a new design. For those situations, I have found <a href=\"http://incident57.com/codekit\">CodeKit</a> by the developers at Incident57 to be incredibly powerful and easy to setup.</p>\n<p><img src=\"./images/Codkit_Sass-1477531567665.png\" alt=\"CodeKit Sass\"></p>\n<h2>Development Web Server Built In</h2>\n<p>As I mentioned before, one of the nice things about CodeKit is that it comes with web server built in complete with hot reload that does not require any plugins whatsoever. Since no plugins are required, the CodeKit provided URL is accessible on mobile devices (if they are connected to the same wireless network) for previewing.</p>\n<p><img src=\"./images/CodeKit_Server-1477531792148.png\" alt=\"CodeKit Server\"></p>\n<h2>Bower</h2>\n<p>The entire library of Bower components are available at the click of a button.</p>\n<h2>Code Linting</h2>\n<p>Codekit comes with JSLint, JSHint and CoffeeLint built in for checking for syntax errors.</p>\n<p><img src=\"./images/CodeKit_JSLint-1477531816990.png\" alt=\"CodeKit JSLint\"></p>\n<h2>Autoprefixer</h2>\n<p>With Sass, Less or Stylus files, browser prefixes are automatically added. No need to remember to add <code>-webkit</code>, <code>-moz,</code> or <code>-ms</code> to your CSS anymore.</p>\n<h2>Optimization</h2>\n<p>CodeKit can combine and minify your JavaScript/CoffeeScript &#x26; Sass files to reduce the number of HTTP requests and decrease the page load time. Source Maps are also provided for easy in browser debugging. Since image assets account for the majority bandwidth of most websites, image optimization is also baked in to reduce the size of PNG and JPG images.</p>\n<h3>Supported Languages:</h3>\n<ul>\n<li>Less</li>\n<li>Sass</li>\n<li>Stylus</li>\n<li>JavaScript</li>\n<li>CoffeeScript</li>\n<li>TypeScript</li>\n<li>Haml</li>\n<li>Jade</li>\n<li>Slim</li>\n<li>Markdown</li>\n<li>JSON</li>\n</ul>\n<p><img src=\"./images/CodeKit_Languages-1477531897939.png\" alt=\"CodeKit Launguages\"></p>","frontmatter":{"title":"CodeKit"}}},"pageContext":{"slug":"/codekit/"}}