{"data":{"markdownRemark":{"html":"<p>SVG has it's own syntax for animation called <a href=\"https://en.wikipedia.org/wiki/Synchronized_Multimedia_Integration_Language#SMIL.2BSVG\">SMIL</a> (Synchronized Multimedia Integration Language). This animation is added directly into the SVG XML markup. Unfortunately, SMIL is not supported in Internet Explorer or Edge browsers and it doesn't look like Microsoft has any <a href=\"https://dev.windows.com/en-us/microsoft-edge/platform/status/svgsmilanimation?filter=f3f0000bf&#x26;search=SMIL\">plans</a> on supporting it in the future.</p>\n<p>Another way that some front end developers implement svg animations is with JavaScript. JavaScript allows for more fine grained control over the animations but it comes at the price of increased complexity. </p>\n<p>Snap.svg, velocity.js, Gsap.js Animation Libraries</p>\n<p>Last, CSS can be used to animate SVG's because it's has good browser support and it's easily styleable.</p>\n<p>CSS animation will not work if the svg is using an <img> embed or if it is used as a background image of an element. As outlined in my SVG Basics article, we can only target inline SVG's with CSS.</p>\n<p>Transform origins in SVG are different than HTML. The default of HTML is (50%,50%) which is the center. SVG uses (0,0) as the origin which is the top left corner. You must set the transform origin property to 50%, 50% which is the center of the SVG element.</p>\n<p>Firefox has a transform-origin bug. Firefox doesn't honor % based origins. We have to use absolute pixels. We can use the \"cx\" &#x26; \"cy\" values in the svg file in pixels</p>\n<p>Use <g> tags for grouping elements together inside an SVG file</p>\n<hr>\n<p>CSS Keyframes with SVG</p>\n<hr>\n<p>CSS Line Properties</p>\n<p>Sets</p>\n<ol>\n<li>Add a stroke to the path</li>\n<li>Set stroke-dasharray equal to path's total length</li>\n<li>Set stroke-dashoffset the same as stroke-dasharray</li>\n<li>Animate stroke-dasharray to 0</li>\n</ol>","frontmatter":{"title":"Back To Basics: Animating SVG With CSS"}}},"pageContext":{"slug":"/using-css-for-animate-svg/"}}